#define RS_CLR	        P3OUT &= ~BIT7           //RS置低
#define RS_SET	        P3OUT |=  BIT7           //RS置高

#define RW_CLR	        P3OUT &= ~BIT6           //RW置低
#define RW_SET	        P3OUT |=  BIT6           //RW置高

#define EN_CLR	        P3OUT &= ~BIT5           //E置低
#define EN_SET	        P3OUT |=  BIT5           //E置高

#define DataPort        P4OUT                    //设置数据口
#define uint unsigned int
#define uchar unsigned char
#include "Config.h"
//*************************************************************************
//			初始化IO口子程序
//*************************************************************************
void Port1602_init()
{

	P4SEL = 0x00;//p4功能选择全为普通IO口
        P4DIR = 0xFF;//全为输出
        P3SEL = 0x00;//p3功能选择全为普通IO口
        P3DIR|= BIT5 + BIT6 + BIT7;     //P3的5,6,7控制口设置为输出模式
}



//***********************************************************************
//	显示屏命令写入函数
//***********************************************************************


void LCD1602_write_com(unsigned char com) 
{	
	RS_CLR;//传入命令模式
	RW_CLR;//写入数据到LCD
	EN_SET;//使能开启
	DataPort = com;                 //命令写入端口也就是p4端口
	delay_ms(5);
	EN_CLR;//使能关闭
}
//***********************************************************************
//	显示屏数据写入函数
//***********************************************************************

void LCD1602_write_data(unsigned char data) 
{
	RS_SET;//传入数据模式
	RW_CLR;//写入数据到LCD
	EN_SET;//使能开启
	DataPort = data;                //数据写入端口
	delay_ms(5);
	EN_CLR;//使能关闭
}
//***********************************************************************
//	显示屏清空显示
//***********************************************************************

void LCD1602_clear(void) 
{
	LCD1602_write_com(0x01);            //清屏幕显示输入清屏命令
	delay_ms(5);
}
//***********************************************************************
//	显示屏字符串写入函数
//***********************************************************************

void LCD1602_write_str(unsigned int x,unsigned int y,char *s) 
{
	
    if (y == 0) 
    {//这个指令用于设置DDRAM地址。在对DDRAM进行读写之前，首先要设置DDRAM地址，然后才能进行读写
    	LCD1602_write_com(0x80 + x);        //第一行显示第x位
    }
    else 
    {
    	LCD1602_write_com(0xC0 + x);        //第二行显示第x位
    }
    
    while (*s) //遍历字符串
    {
    	LCD1602_write_data( *s);
    	s ++;
    }
}
//***********************************************************************
//	显示屏单字符写入函数
//***********************************************************************

void LCD1602_write_char(unsigned char x,unsigned char y,unsigned char data) 
{
	
    if (y == 0) 
    {//这个指令用于设置DDRAM地址。在对DDRAM进行读写之前，首先要设置DDRAM地址，然后才能进行读写
    	LCD1602_write_com(0x80 + x);        //第一行显示首位为1 设置DDRAM地址为0x
    }
    else 
    {
    	LCD1602_write_com(0xC0 + x);        //第二行显示前两位为1
    }
    
    LCD1602_write_data( data);  
}
//***********************************************************************
//	显示屏初始化函数
//***********************************************************************

void LCD1602_init(void) 
{
    LCD1602_write_com(0x38);		//显示模式设置  8位数据接口，两行显示，5×8点阵
    delay_ms(5);
    LCD1602_write_com(0x08);		//显示关闭 
    delay_ms(5);
    LCD1602_write_com(0x01);		//显示清屏
    delay_ms(5);
    LCD1602_write_com(0x06);		//显示光标移动设置 写入新数据后光标右移
    delay_ms(5);
    LCD1602_write_com(0x0C);		//显示开及光标设置 显示开光标不显示不闪烁
    delay_ms(5);
}
//***********************************************************************
//      LCD1602显示函数，只显示一次
//***********************************************************************
void Test_LCD1602(void)
{
     uchar i,j,*p;

     Port1602_init();                        //系统初始化，设置IO口属性
     delay_ms(20);                           //延时20ms
     LCD1602_init();                         //液晶参数初始化设置
     LCD1602_clear();                        //清屏
     for(j=0;j<1;j++) 
      {
		i = 1;
		p = "display test";                //字符串输出显示
		LCD1602_clear();
		LCD1602_write_str(0,0,"Welcome");
		delay_ms(250);
		
		while (*p) {
			LCD1602_write_char(i,1,*p);      //单个字符输出显示
			i ++;
			p ++;
			delay_ms(250);               //延时250ms
			}
		delay_ms(250);
      }
}
